{
  "vocab_size": 256,
  "vocab": {
    "<PAD>": 0,
    "<UNK>": 1,
    "<BOS>": 2,
    "<EOS>": 3,
    "\n": 4,
    " ": 5,
    ".": 6,
    "A": 7,
    "D": 8,
    "M": 9,
    "N": 10,
    "T": 11,
    "a": 12,
    "b": 13,
    "c": 14,
    "d": 15,
    "e": 16,
    "f": 17,
    "g": 18,
    "h": 19,
    "i": 20,
    "j": 21,
    "k": 22,
    "l": 23,
    "m": 24,
    "n": 25,
    "o": 26,
    "p": 27,
    "q": 28,
    "r": 29,
    "s": 30,
    "t": 31,
    "u": 32,
    "v": 33,
    "w": 34,
    "x": 35,
    "y": 36,
    "z": 37,
    "  ": 38,
    "ng": 39,
    "\n  ": 40,
    "\n    ": 41,
    "ing": 42,
    "en": 43,
    "ro": 44,
    "er": 45,
    "la": 46,
    "le": 47,
    "ar": 48,
    "ti": 49,
    "al": 50,
    "ce": 51,
    "fo": 52,
    "lear": 53,
    "learn": 54,
    "el": 55,
    "at": 56,
    "lang": 57,
    "langu": 58,
    "langua": 59,
    "languag": 60,
    "language": 61,
    "ers": 62,
    "an": 63,
    "re": 64,
    "tio": 65,
    "tion": 66,
    "he": 67,
    "qu": 68,
    "ic": 69,
    "um": 70,
    "in": 71,
    "learning": 72,
    "is": 73,
    "se": 74,
    "ence": 75,
    "atu": 76,
    "atur": 77,
    "atural": 78,
    "pro": 79,
    "proce": 80,
    "proces": 81,
    "process": 82,
    "processing": 83,
    "ee": 84,
    "mo": 85,
    "mod": 86,
    "model": 87,
    "for": 88,
    "The": 89,
    "quic": 90,
    "quick": 91,
    "bro": 92,
    "brow": 93,
    "brown": 94,
    "fox": 95,
    "jum": 96,
    "jump": 97,
    "jumps": 98,
    "ov": 99,
    "over": 100,
    "the": 101,
    "laz": 102,
    "lazy": 103,
    "do": 104,
    "dog": 105,
    "dog.": 106,
    "Ma": 107,
    "Mac": 108,
    "Mach": 109,
    "Machin": 110,
    "Machine": 111,
    "su": 112,
    "sub": 113,
    "subse": 114,
    "subset": 115,
    "of": 116,
    "arti": 117,
    "artif": 118,
    "artific": 119,
    "artifici": 120,
    "artificial": 121,
    "int": 122,
    "intel": 123,
    "intell": 124,
    "intelli": 125,
    "intellig": 126,
    "intelligence": 127,
    "intelligence.": 128,
    "Natural": 129,
    "ena": 130,
    "enab": 131,
    "enable": 132,
    "enables": 133,
    "co": 134,
    "com": 135,
    "comp": 136,
    "compu": 137,
    "comput": 138,
    "computers": 139,
    "to": 140,
    "un": 141,
    "und": 142,
    "unders": 143,
    "underst": 144,
    "understan": 145,
    "understand": 146,
    "hum": 147,
    "human": 148,
    "language.": 149,
    "Dee": 150,
    "Deep": 151,
    "models": 152,
    "rep": 153,
    "repre": 154,
    "repres": 155,
    "represen": 156,
    "represent": 157,
    "representa": 158,
    "representation": 159,
    "representations": 160,
    "fro": 161,
    "from": 162,
    "dat": 163,
    "data": 164,
    "data.": 165,
    "Tr": 166,
    "Tran": 167,
    "Trans": 168,
    "Transfor": 169,
    "Transform": 170,
    "Transformers": 171,
    "ha": 172,
    "hav": 173,
    "have": 174,
    "rev": 175,
    "revo": 176,
    "revol": 177,
    "revolu": 178,
    "revolution": 179,
    "revolutioni": 180,
    "revolutioniz": 181,
    "revolutionize": 182,
    "revolutionized": 183,
    "natural": 184,
    "processing.": 185,
    "At": 186,
    "Att": 187,
    "Atten": 188,
    "Attention": 189,
    "all": 190,
    "yo": 191,
    "you": 192,
    "nee": 193,
    "need": 194,
    "sequ": 195,
    "sequence": 196,
    "modeling": 197,
    "modeling.": 198,
    "\n    \n    ": 199
  },
  "merges": {
    " ||| ": "  ",
    "n|||g": "ng",
    "\n|||  ": "\n  ",
    "\n  |||  ": "\n    ",
    "i|||ng": "ing",
    "e|||n": "en",
    "r|||o": "ro",
    "e|||r": "er",
    "l|||a": "la",
    "l|||e": "le",
    "a|||r": "ar",
    "t|||i": "ti",
    "a|||l": "al",
    "c|||e": "ce",
    "f|||o": "fo",
    "le|||ar": "lear",
    "lear|||n": "learn",
    "e|||l": "el",
    "a|||t": "at",
    "la|||ng": "lang",
    "lang|||u": "langu",
    "langu|||a": "langua",
    "langua|||g": "languag",
    "languag|||e": "language",
    "er|||s": "ers",
    "a|||n": "an",
    "r|||e": "re",
    "ti|||o": "tio",
    "tio|||n": "tion",
    "h|||e": "he",
    "q|||u": "qu",
    "i|||c": "ic",
    "u|||m": "um",
    "i|||n": "in",
    "learn|||ing": "learning",
    "i|||s": "is",
    "s|||e": "se",
    "en|||ce": "ence",
    "at|||u": "atu",
    "atu|||r": "atur",
    "atur|||al": "atural",
    "p|||ro": "pro",
    "pro|||ce": "proce",
    "proce|||s": "proces",
    "proces|||s": "process",
    "process|||ing": "processing",
    "e|||e": "ee",
    "m|||o": "mo",
    "mo|||d": "mod",
    "mod|||el": "model",
    "fo|||r": "for",
    "T|||he": "The",
    "qu|||ic": "quic",
    "quic|||k": "quick",
    "b|||ro": "bro",
    "bro|||w": "brow",
    "brow|||n": "brown",
    "fo|||x": "fox",
    "j|||um": "jum",
    "jum|||p": "jump",
    "jump|||s": "jumps",
    "o|||v": "ov",
    "ov|||er": "over",
    "t|||he": "the",
    "la|||z": "laz",
    "laz|||y": "lazy",
    "d|||o": "do",
    "do|||g": "dog",
    "dog|||.": "dog.",
    "M|||a": "Ma",
    "Ma|||c": "Mac",
    "Mac|||h": "Mach",
    "Mach|||in": "Machin",
    "Machin|||e": "Machine",
    "s|||u": "su",
    "su|||b": "sub",
    "sub|||se": "subse",
    "subse|||t": "subset",
    "o|||f": "of",
    "ar|||ti": "arti",
    "arti|||f": "artif",
    "artif|||ic": "artific",
    "artific|||i": "artifici",
    "artifici|||al": "artificial",
    "in|||t": "int",
    "int|||el": "intel",
    "intel|||l": "intell",
    "intell|||i": "intelli",
    "intelli|||g": "intellig",
    "intellig|||ence": "intelligence",
    "intelligence|||.": "intelligence.",
    "N|||atural": "Natural",
    "en|||a": "ena",
    "ena|||b": "enab",
    "enab|||le": "enable",
    "enable|||s": "enables",
    "c|||o": "co",
    "co|||m": "com",
    "com|||p": "comp",
    "comp|||u": "compu",
    "compu|||t": "comput",
    "comput|||ers": "computers",
    "t|||o": "to",
    "u|||n": "un",
    "un|||d": "und",
    "und|||ers": "unders",
    "unders|||t": "underst",
    "underst|||an": "understan",
    "understan|||d": "understand",
    "h|||um": "hum",
    "hum|||an": "human",
    "language|||.": "language.",
    "D|||ee": "Dee",
    "Dee|||p": "Deep",
    "model|||s": "models",
    "re|||p": "rep",
    "rep|||re": "repre",
    "repre|||s": "repres",
    "repres|||en": "represen",
    "represen|||t": "represent",
    "represent|||a": "representa",
    "representa|||tion": "representation",
    "representation|||s": "representations",
    "f|||ro": "fro",
    "fro|||m": "from",
    "d|||at": "dat",
    "dat|||a": "data",
    "data|||.": "data.",
    "T|||r": "Tr",
    "Tr|||an": "Tran",
    "Tran|||s": "Trans",
    "Trans|||for": "Transfor",
    "Transfor|||m": "Transform",
    "Transform|||ers": "Transformers",
    "h|||a": "ha",
    "ha|||v": "hav",
    "hav|||e": "have",
    "re|||v": "rev",
    "rev|||o": "revo",
    "revo|||l": "revol",
    "revol|||u": "revolu",
    "revolu|||tion": "revolution",
    "revolution|||i": "revolutioni",
    "revolutioni|||z": "revolutioniz",
    "revolutioniz|||e": "revolutionize",
    "revolutionize|||d": "revolutionized",
    "n|||atural": "natural",
    "processing|||.": "processing.",
    "A|||t": "At",
    "At|||t": "Att",
    "Att|||en": "Atten",
    "Atten|||tion": "Attention",
    "al|||l": "all",
    "y|||o": "yo",
    "yo|||u": "you",
    "n|||ee": "nee",
    "nee|||d": "need",
    "se|||qu": "sequ",
    "sequ|||ence": "sequence",
    "model|||ing": "modeling",
    "modeling|||.": "modeling.",
    "\n    |||\n    ": "\n    \n    "
  }
}