{
  "vocab_size": 256,
  "mode": "unigram",
  "vocab": {
    "<PAD>": 0,
    "<UNK>": 1,
    "<BOS>": 2,
    "<EOS>": 3,
    ".": 4,
    "D": 5,
    "De": 6,
    "Dee": 7,
    "Deep": 8,
    "Deep▁": 9,
    "Deep▁l": 10,
    "Deep▁le": 11,
    "Deep▁lea": 12,
    "Deep▁lear": 13,
    "Deep▁learn": 14,
    "M": 15,
    "N": 16,
    "T": 17,
    "a": 18,
    "age.": 19,
    "anguage.": 20,
    "an▁": 21,
    "an▁l": 22,
    "an▁la": 23,
    "an▁lan": 24,
    "an▁lang": 25,
    "an▁langu": 26,
    "an▁langua": 27,
    "an▁languag": 28,
    "an▁language": 29,
    "an▁language.": 30,
    "ar": 31,
    "at": 32,
    "atural": 33,
    "b": 34,
    "c": 35,
    "cial": 36,
    "d": 37,
    "da": 38,
    "d▁h": 39,
    "d▁hu": 40,
    "d▁hum": 41,
    "d▁huma": 42,
    "d▁human": 43,
    "d▁human▁": 44,
    "d▁human▁l": 45,
    "d▁human▁la": 46,
    "d▁human▁lan": 47,
    "d▁human▁lang": 48,
    "d▁human▁langu": 49,
    "d▁human▁langua": 50,
    "d▁human▁languag": 51,
    "d▁human▁language": 52,
    "e": 53,
    "ed": 54,
    "ent": 55,
    "ers": 56,
    "es": 57,
    "es.": 58,
    "f": 59,
    "for": 60,
    "g": 61,
    "ge.": 62,
    "guage.": 63,
    "h": 64,
    "ha": 65,
    "hu": 66,
    "hum": 67,
    "huma": 68,
    "human": 69,
    "human▁": 70,
    "human▁l": 71,
    "human▁la": 72,
    "human▁lan": 73,
    "human▁lang": 74,
    "human▁langu": 75,
    "human▁langua": 76,
    "human▁languag": 77,
    "human▁language": 78,
    "human▁language.": 79,
    "i": 80,
    "ing.": 81,
    "j": 82,
    "k": 83,
    "l": 84,
    "language.": 85,
    "ll": 86,
    "m": 87,
    "man": 88,
    "man▁": 89,
    "man▁l": 90,
    "man▁la": 91,
    "man▁lan": 92,
    "man▁lang": 93,
    "man▁langu": 94,
    "man▁langua": 95,
    "man▁languag": 96,
    "man▁language": 97,
    "man▁language.": 98,
    "n": 99,
    "nd▁human▁langua": 100,
    "nd▁human▁languag": 101,
    "ne": 102,
    "nguage.": 103,
    "ns": 104,
    "n▁l": 105,
    "n▁la": 106,
    "n▁lan": 107,
    "n▁lang": 108,
    "n▁langu": 109,
    "n▁langua": 110,
    "n▁languag": 111,
    "n▁language": 112,
    "n▁language.": 113,
    "o": 114,
    "om": 115,
    "or": 116,
    "ou": 117,
    "p": 118,
    "pr": 119,
    "q": 120,
    "r": 121,
    "ra": 122,
    "re": 123,
    "s": 124,
    "t": 125,
    "ta": 126,
    "te": 127,
    "tion": 128,
    "u": 129,
    "uage.": 130,
    "uma": 131,
    "uman": 132,
    "uman▁": 133,
    "uman▁l": 134,
    "uman▁la": 135,
    "uman▁lan": 136,
    "uman▁lang": 137,
    "uman▁langu": 138,
    "uman▁langua": 139,
    "uman▁languag": 140,
    "uman▁language": 141,
    "uman▁language.": 142,
    "und": 143,
    "v": 144,
    "ve": 145,
    "w": 146,
    "x": 147,
    "y": 148,
    "z": 149,
    "▁": 150,
    "▁D": 151,
    "▁De": 152,
    "▁Dee": 153,
    "▁Deep": 154,
    "▁Deep▁": 155,
    "▁Deep▁l": 156,
    "▁Deep▁le": 157,
    "▁Deep▁lea": 158,
    "▁Deep▁lear": 159,
    "▁Deep▁learn": 160,
    "▁Deep▁learni": 161,
    "▁Deep▁learnin": 162,
    "▁Deep▁learning": 163,
    "▁Deep▁learning▁": 164,
    "▁Deep▁learning▁m": 165,
    "▁Machine": 166,
    "▁Natural": 167,
    "▁T": 168,
    "▁The": 169,
    "▁a": 170,
    "▁artificial": 171,
    "▁b": 172,
    "▁brown": 173,
    "▁character": 174,
    "▁computers": 175,
    "▁dog.": 176,
    "▁enables": 177,
    "▁f": 178,
    "▁fox": 179,
    "▁hu": 180,
    "▁hum": 181,
    "▁huma": 182,
    "▁human": 183,
    "▁human▁": 184,
    "▁human▁l": 185,
    "▁human▁la": 186,
    "▁human▁lan": 187,
    "▁human▁lang": 188,
    "▁human▁langu": 189,
    "▁human▁langua": 190,
    "▁human▁languag": 191,
    "▁human▁language": 192,
    "▁human▁language.": 193,
    "▁intelligence.": 194,
    "▁is": 195,
    "▁jumps": 196,
    "▁language": 197,
    "▁language.": 198,
    "▁lazy": 199,
    "▁learn": 200,
    "▁learning": 201,
    "▁m": 202,
    "▁model": 203,
    "▁n": 204,
    "▁of": 205,
    "▁over": 206,
    "▁processing": 207,
    "▁quick": 208,
    "▁re": 209,
    "▁s": 210,
    "▁sequence": 211,
    "▁subset": 212,
    "▁t": 213,
    "▁the": 214,
    "▁to": 215,
    "▁understand": 216,
    "▁▁D": 217,
    "▁▁De": 218,
    "▁▁Dee": 219,
    "▁▁Deep": 220,
    "▁▁Deep▁": 221,
    "▁▁Deep▁l": 222,
    "▁▁Deep▁le": 223,
    "▁▁Deep▁lea": 224,
    "▁▁Deep▁lear": 225,
    "▁▁Deep▁learn": 226,
    "▁▁Deep▁learni": 227,
    "▁▁Deep▁learnin": 228,
    "▁▁Deep▁learning": 229,
    "▁▁Deep▁learning▁": 230,
    "▁▁▁D": 231,
    "▁▁▁De": 232,
    "▁▁▁Dee": 233,
    "▁▁▁Deep": 234,
    "▁▁▁Deep▁": 235,
    "▁▁▁Deep▁l": 236,
    "▁▁▁Deep▁le": 237,
    "▁▁▁Deep▁lea": 238,
    "▁▁▁Deep▁lear": 239,
    "▁▁▁Deep▁learn": 240,
    "▁▁▁Deep▁learni": 241,
    "▁▁▁Deep▁learnin": 242,
    "▁▁▁Deep▁learning": 243,
    "▁▁▁▁D": 244,
    "▁▁▁▁De": 245,
    "▁▁▁▁Dee": 246,
    "▁▁▁▁Deep": 247,
    "▁▁▁▁Deep▁": 248,
    "▁▁▁▁Deep▁l": 249,
    "▁▁▁▁Deep▁le": 250,
    "▁▁▁▁Deep▁lea": 251,
    "▁▁▁▁Deep▁lear": 252,
    "▁▁▁▁Deep▁learn": 253,
    "▁▁▁▁Deep▁learni": 254,
    "▁▁▁▁Deep▁learnin": 255
  },
  "merges": {},
  "vocab_probs": {
    "<PAD>": -23.025850929940457,
    "<UNK>": -23.025850929940457,
    "<BOS>": -23.025850929940457,
    "<EOS>": -23.025850929940457,
    "▁": -4.3025829572752,
    "e": -4.829244073635987,
    "a": -5.16956987957319,
    "n": -5.314751889417688,
    "r": -5.413191962230941,
    "s": -5.561611967349214,
    "t": -5.644993576288265,
    "i": -5.735965354493992,
    "o": -5.735965354493992,
    "l": -5.836048813050974,
    "u": -6.007899069977634,
    "c": -6.007899069977634,
    "g": -6.215538434755878,
    "d": -6.477902699223369,
    "h": -6.701046250537579,
    "m": -6.701046250537579,
    ".": -6.701046250537579,
    "ar": -6.701046250537579,
    "p": -6.834577643162101,
    "te": -6.834577643162101,
    "f": -6.98872832298936,
    "ra": -6.98872832298936,
    "es": -6.98872832298936,
    "at": -7.171049879783315,
    "b": -7.394193431097524,
    "▁t": -7.394193431097524,
    "▁a": -7.394193431097524,
    "▁s": -7.394193431097524,
    "re": -7.394193431097524,
    "▁T": -7.681875503549305,
    "T": -7.681875503549305,
    "q": -7.681875503549305,
    "w": -7.681875503549305,
    "▁f": -7.681875503549305,
    "v": -7.681875503549305,
    "▁learn": -7.681875503549305,
    "▁language": -7.681875503549305,
    "pr": -7.681875503549305,
    "ers": -7.681875503549305,
    "ta": -7.681875503549305,
    "▁m": -7.681875503549305,
    "ent": -7.681875503549305,
    "tion": -7.681875503549305,
    "or": -7.681875503549305,
    "ha": -7.681875503549305,
    "▁The": -8.087340611657469,
    "k": -8.087340611657469,
    "▁b": -8.087340611657469,
    "x": -8.087340611657469,
    "ve": -8.087340611657469,
    "z": -8.087340611657469,
    "y": -8.087340611657469,
    "ne": -8.087340611657469,
    "▁learning": -8.087340611657469,
    "▁is": -8.087340611657469,
    "cial": -8.087340611657469,
    "ll": -8.087340611657469,
    "atural": -8.087340611657469,
    "▁processing": -8.087340611657469,
    "om": -8.087340611657469,
    "und": -8.087340611657469,
    "▁model": -8.087340611657469,
    "▁re": -8.087340611657469,
    "ns": -8.087340611657469,
    "da": -8.087340611657469,
    "for": -8.087340611657469,
    "ed": -8.087340611657469,
    "▁n": -8.087340611657469,
    "ing.": -8.087340611657469,
    "ou": -8.087340611657469,
    "▁sequence": -8.087340611657469,
    "▁character": -8.087340611657469,
    "es.": -8.087340611657469,
    "▁quick": -8.780487792217414,
    "▁brown": -8.780487792217414,
    "▁fox": -8.780487792217414,
    "▁jumps": -8.780487792217414,
    "j": -8.780487792217414,
    "▁over": -8.780487792217414,
    "▁the": -8.780487792217414,
    "▁lazy": -8.780487792217414,
    "▁dog.": -8.780487792217414,
    "▁Machine": -8.780487792217414,
    "M": -8.780487792217414,
    "▁subset": -8.780487792217414,
    "▁of": -8.780487792217414,
    "▁artificial": -8.780487792217414,
    "▁intelligence.": -8.780487792217414,
    "▁Natural": -8.780487792217414,
    "N": -8.780487792217414,
    "▁enables": -8.780487792217414,
    "▁computers": -8.780487792217414,
    "▁to": -8.780487792217414,
    "▁understand": -8.780487792217414,
    "nd▁human▁langua": -8.780487792217414,
    "nd▁human▁languag": -8.780487792217414,
    "d▁h": -8.780487792217414,
    "d▁hu": -8.780487792217414,
    "d▁hum": -8.780487792217414,
    "d▁huma": -8.780487792217414,
    "d▁human": -8.780487792217414,
    "d▁human▁": -8.780487792217414,
    "d▁human▁l": -8.780487792217414,
    "d▁human▁la": -8.780487792217414,
    "d▁human▁lan": -8.780487792217414,
    "d▁human▁lang": -8.780487792217414,
    "d▁human▁langu": -8.780487792217414,
    "d▁human▁langua": -8.780487792217414,
    "d▁human▁languag": -8.780487792217414,
    "d▁human▁language": -8.780487792217414,
    "▁hu": -8.780487792217414,
    "▁hum": -8.780487792217414,
    "▁huma": -8.780487792217414,
    "▁human": -8.780487792217414,
    "▁human▁": -8.780487792217414,
    "▁human▁l": -8.780487792217414,
    "▁human▁la": -8.780487792217414,
    "▁human▁lan": -8.780487792217414,
    "▁human▁lang": -8.780487792217414,
    "▁human▁langu": -8.780487792217414,
    "▁human▁langua": -8.780487792217414,
    "▁human▁languag": -8.780487792217414,
    "▁human▁language": -8.780487792217414,
    "▁human▁language.": -8.780487792217414,
    "hu": -8.780487792217414,
    "hum": -8.780487792217414,
    "huma": -8.780487792217414,
    "human": -8.780487792217414,
    "human▁": -8.780487792217414,
    "human▁l": -8.780487792217414,
    "human▁la": -8.780487792217414,
    "human▁lan": -8.780487792217414,
    "human▁lang": -8.780487792217414,
    "human▁langu": -8.780487792217414,
    "human▁langua": -8.780487792217414,
    "human▁languag": -8.780487792217414,
    "human▁language": -8.780487792217414,
    "human▁language.": -8.780487792217414,
    "uma": -8.780487792217414,
    "uman": -8.780487792217414,
    "uman▁": -8.780487792217414,
    "uman▁l": -8.780487792217414,
    "uman▁la": -8.780487792217414,
    "uman▁lan": -8.780487792217414,
    "uman▁lang": -8.780487792217414,
    "uman▁langu": -8.780487792217414,
    "uman▁langua": -8.780487792217414,
    "uman▁languag": -8.780487792217414,
    "uman▁language": -8.780487792217414,
    "uman▁language.": -8.780487792217414,
    "man": -8.780487792217414,
    "man▁": -8.780487792217414,
    "man▁l": -8.780487792217414,
    "man▁la": -8.780487792217414,
    "man▁lan": -8.780487792217414,
    "man▁lang": -8.780487792217414,
    "man▁langu": -8.780487792217414,
    "man▁langua": -8.780487792217414,
    "man▁languag": -8.780487792217414,
    "man▁language": -8.780487792217414,
    "man▁language.": -8.780487792217414,
    "an▁": -8.780487792217414,
    "an▁l": -8.780487792217414,
    "an▁la": -8.780487792217414,
    "an▁lan": -8.780487792217414,
    "an▁lang": -8.780487792217414,
    "an▁langu": -8.780487792217414,
    "an▁langua": -8.780487792217414,
    "an▁languag": -8.780487792217414,
    "an▁language": -8.780487792217414,
    "an▁language.": -8.780487792217414,
    "n▁l": -8.780487792217414,
    "n▁la": -8.780487792217414,
    "n▁lan": -8.780487792217414,
    "n▁lang": -8.780487792217414,
    "n▁langu": -8.780487792217414,
    "n▁langua": -8.780487792217414,
    "n▁languag": -8.780487792217414,
    "n▁language": -8.780487792217414,
    "n▁language.": -8.780487792217414,
    "▁language.": -8.780487792217414,
    "language.": -8.780487792217414,
    "anguage.": -8.780487792217414,
    "nguage.": -8.780487792217414,
    "guage.": -8.780487792217414,
    "uage.": -8.780487792217414,
    "age.": -8.780487792217414,
    "ge.": -8.780487792217414,
    "▁▁▁▁D": -8.780487792217414,
    "▁▁▁▁De": -8.780487792217414,
    "▁▁▁▁Dee": -8.780487792217414,
    "▁▁▁▁Deep": -8.780487792217414,
    "▁▁▁▁Deep▁": -8.780487792217414,
    "▁▁▁▁Deep▁l": -8.780487792217414,
    "▁▁▁▁Deep▁le": -8.780487792217414,
    "▁▁▁▁Deep▁lea": -8.780487792217414,
    "▁▁▁▁Deep▁lear": -8.780487792217414,
    "▁▁▁▁Deep▁learn": -8.780487792217414,
    "▁▁▁▁Deep▁learni": -8.780487792217414,
    "▁▁▁▁Deep▁learnin": -8.780487792217414,
    "▁▁▁D": -8.780487792217414,
    "▁▁▁De": -8.780487792217414,
    "▁▁▁Dee": -8.780487792217414,
    "▁▁▁Deep": -8.780487792217414,
    "▁▁▁Deep▁": -8.780487792217414,
    "▁▁▁Deep▁l": -8.780487792217414,
    "▁▁▁Deep▁le": -8.780487792217414,
    "▁▁▁Deep▁lea": -8.780487792217414,
    "▁▁▁Deep▁lear": -8.780487792217414,
    "▁▁▁Deep▁learn": -8.780487792217414,
    "▁▁▁Deep▁learni": -8.780487792217414,
    "▁▁▁Deep▁learnin": -8.780487792217414,
    "▁▁▁Deep▁learning": -8.780487792217414,
    "▁▁D": -8.780487792217414,
    "▁▁De": -8.780487792217414,
    "▁▁Dee": -8.780487792217414,
    "▁▁Deep": -8.780487792217414,
    "▁▁Deep▁": -8.780487792217414,
    "▁▁Deep▁l": -8.780487792217414,
    "▁▁Deep▁le": -8.780487792217414,
    "▁▁Deep▁lea": -8.780487792217414,
    "▁▁Deep▁lear": -8.780487792217414,
    "▁▁Deep▁learn": -8.780487792217414,
    "▁▁Deep▁learni": -8.780487792217414,
    "▁▁Deep▁learnin": -8.780487792217414,
    "▁▁Deep▁learning": -8.780487792217414,
    "▁▁Deep▁learning▁": -8.780487792217414,
    "▁D": -8.780487792217414,
    "▁De": -8.780487792217414,
    "▁Dee": -8.780487792217414,
    "▁Deep": -8.780487792217414,
    "▁Deep▁": -8.780487792217414,
    "▁Deep▁l": -8.780487792217414,
    "▁Deep▁le": -8.780487792217414,
    "▁Deep▁lea": -8.780487792217414,
    "▁Deep▁lear": -8.780487792217414,
    "▁Deep▁learn": -8.780487792217414,
    "▁Deep▁learni": -8.780487792217414,
    "▁Deep▁learnin": -8.780487792217414,
    "▁Deep▁learning": -8.780487792217414,
    "▁Deep▁learning▁": -8.780487792217414,
    "▁Deep▁learning▁m": -8.780487792217414,
    "D": -8.780487792217414,
    "De": -8.780487792217414,
    "Dee": -8.780487792217414,
    "Deep": -8.780487792217414,
    "Deep▁": -8.780487792217414,
    "Deep▁l": -8.780487792217414,
    "Deep▁le": -8.780487792217414,
    "Deep▁lea": -8.780487792217414,
    "Deep▁lear": -8.780487792217414,
    "Deep▁learn": -8.780487792217414
  }
}