{
  "vocab_size": 256,
  "mode": "bpe",
  "vocab": {
    "<PAD>": 0,
    "<UNK>": 1,
    "<BOS>": 2,
    "<EOS>": 3,
    ".": 4,
    "A": 5,
    "D": 6,
    "M": 7,
    "N": 8,
    "P": 9,
    "S": 10,
    "T": 11,
    "a": 12,
    "b": 13,
    "c": 14,
    "d": 15,
    "e": 16,
    "f": 17,
    "g": 18,
    "h": 19,
    "i": 20,
    "j": 21,
    "k": 22,
    "l": 23,
    "m": 24,
    "n": 25,
    "o": 26,
    "p": 27,
    "q": 28,
    "r": 29,
    "s": 30,
    "t": 31,
    "u": 32,
    "v": 33,
    "w": 34,
    "x": 35,
    "y": 36,
    "z": 37,
    "▁": 38,
    "ar": 39,
    "ng": 40,
    "en": 41,
    "▁l": 42,
    "ce": 43,
    "er": 44,
    "ing": 45,
    "al": 46,
    "at": 47,
    "ro": 48,
    "▁t": 49,
    "▁la": 50,
    "▁s": 51,
    "ence": 52,
    "re": 53,
    "▁T": 54,
    "he": 55,
    "qu": 56,
    "▁f": 57,
    "ac": 58,
    "▁le": 59,
    "▁lear": 60,
    "▁learn": 61,
    "▁i": 62,
    "ti": 63,
    "el": 64,
    "▁lang": 65,
    "▁langu": 66,
    "▁langua": 67,
    "▁languag": 68,
    "▁language": 69,
    "▁c": 70,
    "ter": 71,
    "nd": 72,
    "▁m": 73,
    "on": 74,
    "or": 75,
    "▁The": 76,
    "ic": 77,
    "▁b": 78,
    "um": 79,
    "▁o": 80,
    "▁d": 81,
    "ne": 82,
    "▁learning": 83,
    "▁is": 84,
    "▁a": 85,
    "ial": 86,
    "atu": 87,
    "atur": 88,
    "atural": 89,
    "▁p": 90,
    "▁pro": 91,
    "▁proce": 92,
    "▁proces": 93,
    "▁process": 94,
    "▁processing": 95,
    "es": 96,
    "und": 97,
    "ers": 98,
    "▁h": 99,
    "an": 100,
    "▁mo": 101,
    "▁mod": 102,
    "▁model": 103,
    "▁re": 104,
    "ent": 105,
    "tion": 106,
    "ed": 107,
    "▁se": 108,
    "▁sequ": 109,
    "▁sequence": 110,
    "▁ch": 111,
    "▁char": 112,
    "▁charac": 113,
    "▁character": 114,
    "▁qu": 115,
    "▁quic": 116,
    "▁quick": 117,
    "▁bro": 118,
    "▁brow": 119,
    "▁brown": 120,
    "▁fo": 121,
    "▁fox": 122,
    "▁j": 123,
    "▁jum": 124,
    "▁jump": 125,
    "▁jumps": 126,
    "▁ov": 127,
    "▁over": 128,
    "▁the": 129,
    "▁laz": 130,
    "▁lazy": 131,
    "▁do": 132,
    "▁dog": 133,
    "▁dog.": 134,
    "▁M": 135,
    "▁Mac": 136,
    "▁Mach": 137,
    "▁Machi": 138,
    "▁Machine": 139,
    "▁su": 140,
    "▁sub": 141,
    "▁subs": 142,
    "▁subse": 143,
    "▁subset": 144,
    "▁of": 145,
    "▁ar": 146,
    "▁arti": 147,
    "▁artif": 148,
    "▁artific": 149,
    "▁artificial": 150,
    "▁in": 151,
    "▁int": 152,
    "▁intel": 153,
    "▁intell": 154,
    "▁intelli": 155,
    "▁intellig": 156,
    "▁intelligence": 157,
    "▁intelligence.": 158,
    "▁N": 159,
    "▁Natural": 160,
    "▁en": 161,
    "▁ena": 162,
    "▁enab": 163,
    "▁enabl": 164,
    "▁enables": 165,
    "▁co": 166,
    "▁com": 167,
    "▁comp": 168,
    "▁compu": 169,
    "▁computer": 170,
    "▁computers": 171,
    "▁to": 172,
    "▁und": 173,
    "▁unders": 174,
    "▁underst": 175,
    "▁understa": 176,
    "▁understand": 177,
    "▁hum": 178,
    "▁human": 179,
    "▁language.": 180,
    "▁D": 181,
    "▁De": 182,
    "▁Dee": 183,
    "▁Deep": 184,
    "▁models": 185,
    "▁rep": 186,
    "▁repre": 187,
    "▁repres": 188,
    "▁represent": 189,
    "▁representat": 190,
    "▁representati": 191,
    "▁representation": 192,
    "▁representations": 193,
    "▁fro": 194,
    "▁from": 195,
    "▁dat": 196,
    "▁data": 197,
    "▁data.": 198,
    "▁Tr": 199,
    "▁Tran": 200,
    "▁Trans": 201,
    "▁Transf": 202,
    "▁Transfor": 203,
    "▁Transform": 204,
    "▁Transformers": 205,
    "▁ha": 206,
    "▁hav": 207,
    "▁have": 208,
    "▁rev": 209,
    "▁revo": 210,
    "▁revol": 211,
    "▁revolu": 212,
    "▁revolution": 213,
    "▁revolutioni": 214,
    "▁revolutioniz": 215,
    "▁revolutionized": 216,
    "▁n": 217,
    "▁natural": 218,
    "▁processing.": 219,
    "▁A": 220,
    "▁At": 221,
    "▁Att": 222,
    "▁Atten": 223,
    "▁Attention": 224,
    "▁al": 225,
    "▁all": 226,
    "▁y": 227,
    "▁yo": 228,
    "▁you": 229,
    "▁ne": 230,
    "▁need": 231,
    "▁for": 232,
    "▁modeling": 233,
    "▁modeling.": 234,
    "▁S": 235,
    "▁Sent": 236,
    "▁Sentence": 237,
    "▁SentenceP": 238,
    "▁SentencePi": 239,
    "▁SentencePie": 240,
    "▁SentencePiece": 241,
    "▁tre": 242,
    "▁treat": 243,
    "▁treats": 244,
    "▁te": 245,
    "▁tex": 246,
    "▁text": 247,
    "▁as": 248,
    "▁r": 249,
    "▁ra": 250,
    "▁raw": 251,
    "▁sequences": 252,
    "▁sequences.": 253,
    "▁sp": 254,
    "▁spe": 255
  },
  "merges": {
    "a|||r": "ar",
    "n|||g": "ng",
    "e|||n": "en",
    "▁|||l": "▁l",
    "c|||e": "ce",
    "e|||r": "er",
    "i|||ng": "ing",
    "a|||l": "al",
    "a|||t": "at",
    "r|||o": "ro",
    "▁|||t": "▁t",
    "▁l|||a": "▁la",
    "▁|||s": "▁s",
    "en|||ce": "ence",
    "r|||e": "re",
    "▁|||T": "▁T",
    "h|||e": "he",
    "q|||u": "qu",
    "▁|||f": "▁f",
    "a|||c": "ac",
    "▁l|||e": "▁le",
    "▁le|||ar": "▁lear",
    "▁lear|||n": "▁learn",
    "▁|||i": "▁i",
    "t|||i": "ti",
    "e|||l": "el",
    "▁la|||ng": "▁lang",
    "▁lang|||u": "▁langu",
    "▁langu|||a": "▁langua",
    "▁langua|||g": "▁languag",
    "▁languag|||e": "▁language",
    "▁|||c": "▁c",
    "t|||er": "ter",
    "n|||d": "nd",
    "▁|||m": "▁m",
    "o|||n": "on",
    "o|||r": "or",
    "▁T|||he": "▁The",
    "i|||c": "ic",
    "▁|||b": "▁b",
    "u|||m": "um",
    "▁|||o": "▁o",
    "▁|||d": "▁d",
    "n|||e": "ne",
    "▁learn|||ing": "▁learning",
    "▁i|||s": "▁is",
    "▁|||a": "▁a",
    "i|||al": "ial",
    "at|||u": "atu",
    "atu|||r": "atur",
    "atur|||al": "atural",
    "▁|||p": "▁p",
    "▁p|||ro": "▁pro",
    "▁pro|||ce": "▁proce",
    "▁proce|||s": "▁proces",
    "▁proces|||s": "▁process",
    "▁process|||ing": "▁processing",
    "e|||s": "es",
    "u|||nd": "und",
    "er|||s": "ers",
    "▁|||h": "▁h",
    "a|||n": "an",
    "▁m|||o": "▁mo",
    "▁mo|||d": "▁mod",
    "▁mod|||el": "▁model",
    "▁|||re": "▁re",
    "en|||t": "ent",
    "ti|||on": "tion",
    "e|||d": "ed",
    "▁s|||e": "▁se",
    "▁se|||qu": "▁sequ",
    "▁sequ|||ence": "▁sequence",
    "▁c|||h": "▁ch",
    "▁ch|||ar": "▁char",
    "▁char|||ac": "▁charac",
    "▁charac|||ter": "▁character",
    "▁|||qu": "▁qu",
    "▁qu|||ic": "▁quic",
    "▁quic|||k": "▁quick",
    "▁b|||ro": "▁bro",
    "▁bro|||w": "▁brow",
    "▁brow|||n": "▁brown",
    "▁f|||o": "▁fo",
    "▁fo|||x": "▁fox",
    "▁|||j": "▁j",
    "▁j|||um": "▁jum",
    "▁jum|||p": "▁jump",
    "▁jump|||s": "▁jumps",
    "▁o|||v": "▁ov",
    "▁ov|||er": "▁over",
    "▁t|||he": "▁the",
    "▁la|||z": "▁laz",
    "▁laz|||y": "▁lazy",
    "▁d|||o": "▁do",
    "▁do|||g": "▁dog",
    "▁dog|||.": "▁dog.",
    "▁|||M": "▁M",
    "▁M|||ac": "▁Mac",
    "▁Mac|||h": "▁Mach",
    "▁Mach|||i": "▁Machi",
    "▁Machi|||ne": "▁Machine",
    "▁s|||u": "▁su",
    "▁su|||b": "▁sub",
    "▁sub|||s": "▁subs",
    "▁subs|||e": "▁subse",
    "▁subse|||t": "▁subset",
    "▁o|||f": "▁of",
    "▁|||ar": "▁ar",
    "▁ar|||ti": "▁arti",
    "▁arti|||f": "▁artif",
    "▁artif|||ic": "▁artific",
    "▁artific|||ial": "▁artificial",
    "▁i|||n": "▁in",
    "▁in|||t": "▁int",
    "▁int|||el": "▁intel",
    "▁intel|||l": "▁intell",
    "▁intell|||i": "▁intelli",
    "▁intelli|||g": "▁intellig",
    "▁intellig|||ence": "▁intelligence",
    "▁intelligence|||.": "▁intelligence.",
    "▁|||N": "▁N",
    "▁N|||atural": "▁Natural",
    "▁|||en": "▁en",
    "▁en|||a": "▁ena",
    "▁ena|||b": "▁enab",
    "▁enab|||l": "▁enabl",
    "▁enabl|||es": "▁enables",
    "▁c|||o": "▁co",
    "▁co|||m": "▁com",
    "▁com|||p": "▁comp",
    "▁comp|||u": "▁compu",
    "▁compu|||ter": "▁computer",
    "▁computer|||s": "▁computers",
    "▁t|||o": "▁to",
    "▁|||und": "▁und",
    "▁und|||ers": "▁unders",
    "▁unders|||t": "▁underst",
    "▁underst|||a": "▁understa",
    "▁understa|||nd": "▁understand",
    "▁h|||um": "▁hum",
    "▁hum|||an": "▁human",
    "▁language|||.": "▁language.",
    "▁|||D": "▁D",
    "▁D|||e": "▁De",
    "▁De|||e": "▁Dee",
    "▁Dee|||p": "▁Deep",
    "▁model|||s": "▁models",
    "▁re|||p": "▁rep",
    "▁rep|||re": "▁repre",
    "▁repre|||s": "▁repres",
    "▁repres|||ent": "▁represent",
    "▁represent|||at": "▁representat",
    "▁representat|||i": "▁representati",
    "▁representati|||on": "▁representation",
    "▁representation|||s": "▁representations",
    "▁f|||ro": "▁fro",
    "▁fro|||m": "▁from",
    "▁d|||at": "▁dat",
    "▁dat|||a": "▁data",
    "▁data|||.": "▁data.",
    "▁T|||r": "▁Tr",
    "▁Tr|||an": "▁Tran",
    "▁Tran|||s": "▁Trans",
    "▁Trans|||f": "▁Transf",
    "▁Transf|||or": "▁Transfor",
    "▁Transfor|||m": "▁Transform",
    "▁Transform|||ers": "▁Transformers",
    "▁h|||a": "▁ha",
    "▁ha|||v": "▁hav",
    "▁hav|||e": "▁have",
    "▁re|||v": "▁rev",
    "▁rev|||o": "▁revo",
    "▁revo|||l": "▁revol",
    "▁revol|||u": "▁revolu",
    "▁revolu|||tion": "▁revolution",
    "▁revolution|||i": "▁revolutioni",
    "▁revolutioni|||z": "▁revolutioniz",
    "▁revolutioniz|||ed": "▁revolutionized",
    "▁|||n": "▁n",
    "▁n|||atural": "▁natural",
    "▁processing|||.": "▁processing.",
    "▁|||A": "▁A",
    "▁A|||t": "▁At",
    "▁At|||t": "▁Att",
    "▁Att|||en": "▁Atten",
    "▁Atten|||tion": "▁Attention",
    "▁|||al": "▁al",
    "▁al|||l": "▁all",
    "▁|||y": "▁y",
    "▁y|||o": "▁yo",
    "▁yo|||u": "▁you",
    "▁|||ne": "▁ne",
    "▁ne|||ed": "▁need",
    "▁f|||or": "▁for",
    "▁model|||ing": "▁modeling",
    "▁modeling|||.": "▁modeling.",
    "▁|||S": "▁S",
    "▁S|||ent": "▁Sent",
    "▁Sent|||ence": "▁Sentence",
    "▁Sentence|||P": "▁SentenceP",
    "▁SentenceP|||i": "▁SentencePi",
    "▁SentencePi|||e": "▁SentencePie",
    "▁SentencePie|||ce": "▁SentencePiece",
    "▁t|||re": "▁tre",
    "▁tre|||at": "▁treat",
    "▁treat|||s": "▁treats",
    "▁t|||e": "▁te",
    "▁te|||x": "▁tex",
    "▁tex|||t": "▁text",
    "▁a|||s": "▁as",
    "▁|||r": "▁r",
    "▁r|||a": "▁ra",
    "▁ra|||w": "▁raw",
    "▁sequence|||s": "▁sequences",
    "▁sequences|||.": "▁sequences.",
    "▁s|||p": "▁sp",
    "▁sp|||e": "▁spe"
  },
  "vocab_probs": {}
}