{
  "vocab_size": 256,
  "vocab": {
    "<PAD>": 0,
    "<UNK>": 1,
    "<BOS>": 2,
    "<EOS>": 3,
    ".": 4,
    "A": 5,
    "Attention": 6,
    "D": 7,
    "Deep": 8,
    "M": 9,
    "Machine": 10,
    "N": 11,
    "Natural": 12,
    "T": 13,
    "The": 14,
    "Transformers": 15,
    "U": 16,
    "Unigram": 17,
    "V": 18,
    "Vi": 19,
    "Vit": 20,
    "Vite": 21,
    "Viter": 22,
    "Viterb": 23,
    "Viterbi": 24,
    "a": 25,
    "alg": 26,
    "algo": 27,
    "algor": 28,
    "algori": 29,
    "algorit": 30,
    "algorith": 31,
    "algorithm": 32,
    "all": 33,
    "artificial": 34,
    "b": 35,
    "brown": 36,
    "c": 37,
    "computers": 38,
    "d": 39,
    "data.": 40,
    "dog.": 41,
    "ds": 42,
    "e": 43,
    "eg": 44,
    "egm": 45,
    "egme": 46,
    "egmen": 47,
    "egment": 48,
    "egmenta": 49,
    "egmentat": 50,
    "egmentati": 51,
    "egmentatio": 52,
    "egmentation": 53,
    "egmentation.": 54,
    "ely": 55,
    "enables": 56,
    "eni": 57,
    "eniz": 58,
    "eniza": 59,
    "enizat": 60,
    "enizati": 61,
    "enizatio": 62,
    "enization": 63,
    "enization.": 64,
    "entation.": 65,
    "erb": 66,
    "erbi": 67,
    "f": 68,
    "fin": 69,
    "find": 70,
    "finds": 71,
    "for": 72,
    "fox": 73,
    "from": 74,
    "g": 75,
    "gm": 76,
    "gme": 77,
    "gmen": 78,
    "gment": 79,
    "gmenta": 80,
    "gmentat": 81,
    "gmentati": 82,
    "gmentatio": 83,
    "gmentation": 84,
    "gmentation.": 85,
    "go": 86,
    "gor": 87,
    "gori": 88,
    "gorit": 89,
    "gorith": 90,
    "gorithm": 91,
    "h": 92,
    "have": 93,
    "hm": 94,
    "human": 95,
    "i": 96,
    "ik": 97,
    "ike": 98,
    "ikel": 99,
    "ikely": 100,
    "ind": 101,
    "inds": 102,
    "intelligence.": 103,
    "is": 104,
    "ite": 105,
    "iter": 106,
    "iterb": 107,
    "iterbi": 108,
    "ith": 109,
    "ithm": 110,
    "iza": 111,
    "izat": 112,
    "izati": 113,
    "izatio": 114,
    "ization": 115,
    "ization.": 116,
    "j": 117,
    "jumps": 118,
    "k": 119,
    "kel": 120,
    "kely": 121,
    "ken": 122,
    "keni": 123,
    "keniz": 124,
    "keniza": 125,
    "kenizat": 126,
    "kenizati": 127,
    "kenizatio": 128,
    "kenization": 129,
    "kenization.": 130,
    "l": 131,
    "language": 132,
    "language.": 133,
    "lazy": 134,
    "learn": 135,
    "learning": 136,
    "lg": 137,
    "lgo": 138,
    "lgor": 139,
    "lgori": 140,
    "lgorit": 141,
    "lgorith": 142,
    "lgorithm": 143,
    "lik": 144,
    "like": 145,
    "likel": 146,
    "likely": 147,
    "ly": 148,
    "m": 149,
    "men": 150,
    "ment": 151,
    "menta": 152,
    "mentat": 153,
    "mentati": 154,
    "mentatio": 155,
    "mentation": 156,
    "mentation.": 157,
    "modeling.": 158,
    "models": 159,
    "mos": 160,
    "most": 161,
    "n": 162,
    "natural": 163,
    "nds": 164,
    "need": 165,
    "niza": 166,
    "nizat": 167,
    "nizati": 168,
    "nizatio": 169,
    "nization": 170,
    "nization.": 171,
    "ntation.": 172,
    "o": 173,
    "of": 174,
    "ok": 175,
    "oke": 176,
    "oken": 177,
    "okeni": 178,
    "okeniz": 179,
    "okeniza": 180,
    "okenizat": 181,
    "okenizati": 182,
    "okenizatio": 183,
    "okenization": 184,
    "okenization.": 185,
    "ori": 186,
    "orit": 187,
    "orith": 188,
    "orithm": 189,
    "os": 190,
    "ost": 191,
    "over": 192,
    "p": 193,
    "probabilistic": 194,
    "processing": 195,
    "processing.": 196,
    "q": 197,
    "quick": 198,
    "r": 199,
    "rb": 200,
    "rbi": 201,
    "representations": 202,
    "revolutionized": 203,
    "ri": 204,
    "rit": 205,
    "rith": 206,
    "rithm": 207,
    "s": 208,
    "seg": 209,
    "segm": 210,
    "segme": 211,
    "segmen": 212,
    "segment": 213,
    "segmenta": 214,
    "segmentat": 215,
    "segmentati": 216,
    "segmentatio": 217,
    "segmentation": 218,
    "segmentation.": 219,
    "sequence": 220,
    "subset": 221,
    "t": 222,
    "tation.": 223,
    "terb": 224,
    "terbi": 225,
    "the": 226,
    "thm": 227,
    "tic": 228,
    "to": 229,
    "tok": 230,
    "toke": 231,
    "token": 232,
    "tokeni": 233,
    "tokeniz": 234,
    "tokeniza": 235,
    "tokenizat": 236,
    "tokenizati": 237,
    "tokenizatio": 238,
    "tokenization": 239,
    "tokenization.": 240,
    "u": 241,
    "understand": 242,
    "use": 243,
    "v": 244,
    "w": 245,
    "x": 246,
    "y": 247,
    "you": 248,
    "z": 249,
    "za": 250,
    "zat": 251,
    "zati": 252,
    "zatio": 253,
    "zation": 254,
    "zation.": 255
  },
  "vocab_probs": {
    "<PAD>": -23.025850929940457,
    "<UNK>": -23.025850929940457,
    "<BOS>": -23.025850929940457,
    "<EOS>": -23.025850929940457,
    "e": -3.6707818941031336,
    "n": -3.973062765976067,
    "a": -4.033687387792502,
    "i": -4.098225908930073,
    "o": -4.241326752570746,
    "t": -4.280547465724028,
    "r": -4.3213694602442825,
    "s": -4.3213694602442825,
    "l": -4.363929074663079,
    "g": -4.726834568352447,
    "u": -4.791373089490018,
    "m": -5.014516640804228,
    "d": -5.196838197598183,
    "c": -5.3021987132560096,
    "h": -5.4199817489123925,
    ".": -5.4199817489123925,
    "f": -5.553513141536915,
    "p": -5.553513141536915,
    "b": -5.707663821364173,
    "T": -6.400811001924119,
    "k": -6.400811001924119,
    "v": -6.400811001924119,
    "z": -6.400811001924119,
    "y": -6.400811001924119,
    "learn": -6.400811001924119,
    "is": -6.400811001924119,
    "language": -6.400811001924119,
    "The": -6.806276110032283,
    "q": -6.806276110032283,
    "the": -6.806276110032283,
    "learning": -6.806276110032283,
    "processing": -6.806276110032283,
    "to": -6.806276110032283,
    "models": -6.806276110032283,
    "for": -6.806276110032283,
    "quick": -7.499423290592229,
    "brown": -7.499423290592229,
    "w": -7.499423290592229,
    "fox": -7.499423290592229,
    "x": -7.499423290592229,
    "j": -7.499423290592229,
    "jumps": -7.499423290592229,
    "over": -7.499423290592229,
    "lazy": -7.499423290592229,
    "dog.": -7.499423290592229,
    "M": -7.499423290592229,
    "Machine": -7.499423290592229,
    "subset": -7.499423290592229,
    "of": -7.499423290592229,
    "artificial": -7.499423290592229,
    "intelligence.": -7.499423290592229,
    "N": -7.499423290592229,
    "Natural": -7.499423290592229,
    "enables": -7.499423290592229,
    "computers": -7.499423290592229,
    "understand": -7.499423290592229,
    "human": -7.499423290592229,
    "language.": -7.499423290592229,
    "D": -7.499423290592229,
    "Deep": -7.499423290592229,
    "representations": -7.499423290592229,
    "from": -7.499423290592229,
    "data.": -7.499423290592229,
    "Transformers": -7.499423290592229,
    "have": -7.499423290592229,
    "revolutionized": -7.499423290592229,
    "natural": -7.499423290592229,
    "processing.": -7.499423290592229,
    "A": -7.499423290592229,
    "Attention": -7.499423290592229,
    "all": -7.499423290592229,
    "you": -7.499423290592229,
    "need": -7.499423290592229,
    "sequence": -7.499423290592229,
    "modeling.": -7.499423290592229,
    "U": -7.499423290592229,
    "Unigram": -7.499423290592229,
    "use": -7.499423290592229,
    "probabilistic": -7.499423290592229,
    "tic": -7.499423290592229,
    "tok": -7.499423290592229,
    "toke": -7.499423290592229,
    "token": -7.499423290592229,
    "tokeni": -7.499423290592229,
    "tokeniz": -7.499423290592229,
    "tokeniza": -7.499423290592229,
    "tokenizat": -7.499423290592229,
    "tokenizati": -7.499423290592229,
    "tokenizatio": -7.499423290592229,
    "tokenization": -7.499423290592229,
    "tokenization.": -7.499423290592229,
    "ok": -7.499423290592229,
    "oke": -7.499423290592229,
    "oken": -7.499423290592229,
    "okeni": -7.499423290592229,
    "okeniz": -7.499423290592229,
    "okeniza": -7.499423290592229,
    "okenizat": -7.499423290592229,
    "okenizati": -7.499423290592229,
    "okenizatio": -7.499423290592229,
    "okenization": -7.499423290592229,
    "okenization.": -7.499423290592229,
    "ken": -7.499423290592229,
    "keni": -7.499423290592229,
    "keniz": -7.499423290592229,
    "keniza": -7.499423290592229,
    "kenizat": -7.499423290592229,
    "kenizati": -7.499423290592229,
    "kenizatio": -7.499423290592229,
    "kenization": -7.499423290592229,
    "kenization.": -7.499423290592229,
    "eni": -7.499423290592229,
    "eniz": -7.499423290592229,
    "eniza": -7.499423290592229,
    "enizat": -7.499423290592229,
    "enizati": -7.499423290592229,
    "enizatio": -7.499423290592229,
    "enization": -7.499423290592229,
    "enization.": -7.499423290592229,
    "niza": -7.499423290592229,
    "nizat": -7.499423290592229,
    "nizati": -7.499423290592229,
    "nizatio": -7.499423290592229,
    "nization": -7.499423290592229,
    "nization.": -7.499423290592229,
    "iza": -7.499423290592229,
    "izat": -7.499423290592229,
    "izati": -7.499423290592229,
    "izatio": -7.499423290592229,
    "ization": -7.499423290592229,
    "ization.": -7.499423290592229,
    "za": -7.499423290592229,
    "zat": -7.499423290592229,
    "zati": -7.499423290592229,
    "zatio": -7.499423290592229,
    "zation": -7.499423290592229,
    "zation.": -7.499423290592229,
    "V": -7.499423290592229,
    "Vi": -7.499423290592229,
    "Vit": -7.499423290592229,
    "Vite": -7.499423290592229,
    "Viter": -7.499423290592229,
    "Viterb": -7.499423290592229,
    "Viterbi": -7.499423290592229,
    "ite": -7.499423290592229,
    "iter": -7.499423290592229,
    "iterb": -7.499423290592229,
    "iterbi": -7.499423290592229,
    "terb": -7.499423290592229,
    "terbi": -7.499423290592229,
    "erb": -7.499423290592229,
    "erbi": -7.499423290592229,
    "rb": -7.499423290592229,
    "rbi": -7.499423290592229,
    "alg": -7.499423290592229,
    "algo": -7.499423290592229,
    "algor": -7.499423290592229,
    "algori": -7.499423290592229,
    "algorit": -7.499423290592229,
    "algorith": -7.499423290592229,
    "algorithm": -7.499423290592229,
    "lg": -7.499423290592229,
    "lgo": -7.499423290592229,
    "lgor": -7.499423290592229,
    "lgori": -7.499423290592229,
    "lgorit": -7.499423290592229,
    "lgorith": -7.499423290592229,
    "lgorithm": -7.499423290592229,
    "go": -7.499423290592229,
    "gor": -7.499423290592229,
    "gori": -7.499423290592229,
    "gorit": -7.499423290592229,
    "gorith": -7.499423290592229,
    "gorithm": -7.499423290592229,
    "ori": -7.499423290592229,
    "orit": -7.499423290592229,
    "orith": -7.499423290592229,
    "orithm": -7.499423290592229,
    "ri": -7.499423290592229,
    "rit": -7.499423290592229,
    "rith": -7.499423290592229,
    "rithm": -7.499423290592229,
    "ith": -7.499423290592229,
    "ithm": -7.499423290592229,
    "thm": -7.499423290592229,
    "hm": -7.499423290592229,
    "fin": -7.499423290592229,
    "find": -7.499423290592229,
    "finds": -7.499423290592229,
    "ind": -7.499423290592229,
    "inds": -7.499423290592229,
    "nds": -7.499423290592229,
    "ds": -7.499423290592229,
    "mos": -7.499423290592229,
    "most": -7.499423290592229,
    "os": -7.499423290592229,
    "ost": -7.499423290592229,
    "lik": -7.499423290592229,
    "like": -7.499423290592229,
    "likel": -7.499423290592229,
    "likely": -7.499423290592229,
    "ik": -7.499423290592229,
    "ike": -7.499423290592229,
    "ikel": -7.499423290592229,
    "ikely": -7.499423290592229,
    "kel": -7.499423290592229,
    "kely": -7.499423290592229,
    "ely": -7.499423290592229,
    "ly": -7.499423290592229,
    "seg": -7.499423290592229,
    "segm": -7.499423290592229,
    "segme": -7.499423290592229,
    "segmen": -7.499423290592229,
    "segment": -7.499423290592229,
    "segmenta": -7.499423290592229,
    "segmentat": -7.499423290592229,
    "segmentati": -7.499423290592229,
    "segmentatio": -7.499423290592229,
    "segmentation": -7.499423290592229,
    "segmentation.": -7.499423290592229,
    "eg": -7.499423290592229,
    "egm": -7.499423290592229,
    "egme": -7.499423290592229,
    "egmen": -7.499423290592229,
    "egment": -7.499423290592229,
    "egmenta": -7.499423290592229,
    "egmentat": -7.499423290592229,
    "egmentati": -7.499423290592229,
    "egmentatio": -7.499423290592229,
    "egmentation": -7.499423290592229,
    "egmentation.": -7.499423290592229,
    "gm": -7.499423290592229,
    "gme": -7.499423290592229,
    "gmen": -7.499423290592229,
    "gment": -7.499423290592229,
    "gmenta": -7.499423290592229,
    "gmentat": -7.499423290592229,
    "gmentati": -7.499423290592229,
    "gmentatio": -7.499423290592229,
    "gmentation": -7.499423290592229,
    "gmentation.": -7.499423290592229,
    "men": -7.499423290592229,
    "ment": -7.499423290592229,
    "menta": -7.499423290592229,
    "mentat": -7.499423290592229,
    "mentati": -7.499423290592229,
    "mentatio": -7.499423290592229,
    "mentation": -7.499423290592229,
    "mentation.": -7.499423290592229,
    "entation.": -7.499423290592229,
    "ntation.": -7.499423290592229,
    "tation.": -7.499423290592229
  },
  "merges": {}
}