{
  "vocab_size": 256,
  "vocab": {
    "<PAD>": 0,
    "<UNK>": 1,
    "<BOS>": 2,
    "<EOS>": 3,
    "[CLS]": 4,
    "[SEP]": 5,
    "[MASK]": 6,
    "##.": 7,
    "##E": 8,
    "##P": 9,
    "##R": 10,
    "##T": 11,
    "##a": 12,
    "##b": 13,
    "##c": 14,
    "##d": 15,
    "##e": 16,
    "##f": 17,
    "##g": 18,
    "##h": 19,
    "##i": 20,
    "##k": 21,
    "##l": 22,
    "##m": 23,
    "##n": 24,
    "##o": 25,
    "##p": 26,
    "##q": 27,
    "##r": 28,
    "##s": 29,
    "##t": 30,
    "##u": 31,
    "##v": 32,
    "##w": 33,
    "##x": 34,
    "##y": 35,
    "##z": 36,
    "A": 37,
    "B": 38,
    "D": 39,
    "M": 40,
    "N": 41,
    "T": 42,
    "W": 43,
    "a": 44,
    "b": 45,
    "c": 46,
    "d": 47,
    "e": 48,
    "f": 49,
    "h": 50,
    "i": 51,
    "j": 52,
    "l": 53,
    "m": 54,
    "n": 55,
    "o": 56,
    "p": 57,
    "q": 58,
    "r": 59,
    "s": 60,
    "t": 61,
    "u": 62,
    "y": 63,
    "BE": 64,
    "BER": 65,
    "BERT": 66,
    "##zy": 67,
    "Th": 68,
    "ov": 69,
    "of": 70,
    "##bw": 71,
    "th": 72,
    "##ch": 73,
    "##mp": 74,
    "##dP": 75,
    "qu": 76,
    "ju": 77,
    "jump": 78,
    "##mpu": 79,
    "##qu": 80,
    "##ubw": 81,
    "subw": 82,
    "##mput": 83,
    "At": 84,
    "Att": 85,
    "su": 86,
    "sub": 87,
    "##bl": 88,
    "qui": 89,
    "quic": 90,
    "quick": 91,
    "##chi": 92,
    "##iz": 93,
    "##dPi": 94,
    "br": 95,
    "pr": 96,
    "Tr": 97,
    "##rdPi": 98,
    "jumps": 99,
    "subs": 100,
    "bro": 101,
    "brow": 102,
    "##ox": 103,
    "fox": 104,
    "co": 105,
    "comput": 106,
    "to": 107,
    "tok": 108,
    "yo": 109,
    "you": 110,
    "Wo": 111,
    "WordPi": 112,
    "subwo": 113,
    "subwor": 114,
    "subword": 115,
    "mo": 116,
    "mod": 117,
    "pro": 118,
    "proc": 119,
    "fo": 120,
    "fr": 121,
    "fro": 122,
    "from": 123,
    "do": 124,
    "##fo": 125,
    "##vo": 126,
    "##vol": 127,
    "##volu": 128,
    "##um": 129,
    "hum": 130,
    "##for": 131,
    "##form": 132,
    "for": 133,
    "##volut": 134,
    "dog": 135,
    "dog.": 136,
    "##if": 137,
    "##tif": 138,
    "##rtif": 139,
    "artif": 140,
    "artifi": 141,
    "artific": 142,
    "artifici": 143,
    "##io": 144,
    "##volutio": 145,
    "##tio": 146,
    "hi": 147,
    "hid": 148,
    "hidd": 149,
    "##pr": 150,
    "##sform": 151,
    "##sk": 152,
    "al": 153,
    "all": 154,
    "##gu": 155,
    "##tu": 156,
    "##tur": 157,
    "is": 158,
    "##azy": 159,
    "lazy": 160,
    "Ma": 161,
    "Machi": 162,
    "artificia": 163,
    "artificial": 164,
    "Na": 165,
    "Natur": 166,
    "Natura": 167,
    "Natural": 168,
    "##gua": 169,
    "##guag": 170,
    "##abl": 171,
    "huma": 172,
    "da": 173,
    "dat": 174,
    "data": 175,
    "data.": 176,
    "Tra": 177,
    "ha": 178,
    "hav": 179,
    "##atur": 180,
    "natur": 181,
    "natura": 182,
    "natural": 183,
    "ma": 184,
    "mask": 185,
    "##atio": 186,
    "##izatio": 187,
    "##tatio": 188,
    "la": 189,
    "##ar": 190,
    "##ta": 191,
    "##sta": 192,
    "##rsta": 193,
    "##ct": 194,
    "##ict": 195,
    "##dict": 196,
    "##dicts": 197,
    "##li": 198,
    "##lli": 199,
    "##llig": 200,
    "##g.": 201,
    "##it": 202,
    "##its": 203,
    "##its.": 204,
    "##rs": 205,
    "##si": 206,
    "##ssi": 207,
    "##ls": 208,
    "us": 209,
    "##s.": 210,
    "brown": 211,
    "Machin": 212,
    "##arn": 213,
    "##arni": 214,
    "##arnin": 215,
    "##arning": 216,
    "in": 217,
    "int": 218,
    "lan": 219,
    "languag": 220,
    "##ssin": 221,
    "##ssing": 222,
    "##ssing.": 223,
    "en": 224,
    "enabl": 225,
    "un": 226,
    "units.": 227,
    "und": 228,
    "##rstan": 229,
    "##rstand": 230,
    "human": 231,
    "##ntatio": 232,
    "##ntation": 233,
    "##ntations": 234,
    "Tran": 235,
    "Transform": 236,
    "##volution": 237,
    "##volutioniz": 238,
    "##ntio": 239,
    "##ntion": 240,
    "##lin": 241,
    "##ling.": 242,
    "##nizatio": 243,
    "##nization": 244,
    "##ns.": 245,
    "##nc": 246,
    "The": 247,
    "ove": 248,
    "over": 249,
    "the": 250,
    "Machine": 251,
    "le": 252,
    "learning": 253,
    "learn": 254,
    "subse": 255
  },
  "merges": {}
}